import 'package:easy_localization/easy_localization.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:nourex/core/extensions/navigation_extension.dart';
import 'package:nourex/core/themes/text_colors.dart';
import 'package:nourex/core/widgets/appbar/main_app_bar_2_widget.dart';

class TermsAndConditionsScreen extends StatelessWidget {
  const TermsAndConditionsScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      appBar: PreferredSize(
        preferredSize: Size.fromHeight(74.h),
        child: MainAppBar2Widget(
          title: 'termsAndConditions'.tr(),
          isSubScreen: true,
          haveOnlyNotification: false,
          onTapBack: () {
            context.pop();
          },
          onTapSearch: () {},
        ),
      ),
      body: Padding(
        padding: EdgeInsets.only(top: 18.h, left: 18.w, right: 18.w),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text(
                '''
شروط وأحكام استخدام تطبيق نوريكس
مرحبًا بكم في تطبيق نوريكس، منصة إلكترونية تتيح للمستخدمين شراء وبيع المنتجات ضمن الجمهورية العربية السورية. باستخدامك للتطبيق، فإنك توافق على الالتزام بهذه الشروط والأحكام. نذكّر أن جميع الأنشطة ضمن التطبيق يجب أن تكون متوافقة مع القوانين المحلية، ومع الضوابط الشرعية الإسلامية، ونرفض أي محتوى يخالف ذلك.
1. التعريفات
- المستخدم: أي شخص يستخدم التطبيق سواء كمشتري أو كبائع. - البائع: أي شخص أو جهة تقوم بعرض منتجاتها على منصة نوريكس. - المشتري: أي شخص يستخدم التطبيق لشراء منتجات. - نوريكس: المنصة التي تدير التطبيق وتوفر خدماته.
2. التسجيل واستخدام الحساب
يجب أن يكون عمر المستخدم 18 سنة أو أكثر. يلتزم المستخدم بإدخال معلومات صحيحة. لا يجوز مشاركة معلومات الدخول مع أطراف أخرى.
3. التزامات البائعين
 - يجب أن تكون المنتجات قانونية ومطابقة للشريعة الإسلامية. - يُمنع منعًا باتًا عرض أو بيع أي منتجات محرّمة شرعًا مثل: الخمور، التماثيل الدينية، المواد الإباحية... - في حال المخالفة: يتم حذف المنتج، إرسال إنذار، وحظر الحساب عند التكرار. - يلتزم البائع بالشحن في الموعد، بجودة المنتج، ودفع الرسوم الشهرية والعمولات. 
4. الدفع والتوصيل
يتم الدفع نقدًا عند الاستلام. التوصيل عبر شركات توصيل أو من قبل البائع. الرسوم تختلف حسب المنطقة.
5. الإرجاع والاسترداد
يحق للمشتري الإرجاع وفق سياسة البائع ويتحمل رسوم الشحن. لا تُحتسب عمولة نوريكس على المرتجعات.
6. حقوق الملكية
جميع المحتويات ملك لنوريكس ولا يجوز استخدامها دون إذن. المحتوى المقدم يجب ألا ينتهك حقوق الآخرين.
7. حدود المسؤولية
نوريكس غير مسؤولة عن مشاكل ناتجة عن تعامل مباشر بين المستخدمين.
8. تعديل الشروط
تحتفظ نوريكس بحق تعديل الشروط في أي وقت بعد إشعار المستخدمين.
9. القانون الناظم
تخضع الشروط للقوانين السورية. النزاعات تُحل في محاكم حمص.
10. الخصوصية
نوريكس تلتزم بحماية بيانات المستخدمين وعدم مشاركتها إلا لتقديم الخدمة أو بطلب قانوني.
11. إساءة الاستخدام
يمنع استخدام التطبيق لأغراض غير قانونية أو احتيالية.
12. رفض الاستلام المتكرر
يحق لنوريكس تعليق حساب أي مستخدم يرفض الطلبات بدون سبب مقنع أكثر من مرة.
13. التقييمات
يسمح بالتقييمات بشرط أن تكون لائقة وغير مسيئة. تحتفظ نوريكس بحق الحذف.
14. تعديل الأسعار والرسوم
يحق لنوريكس تعديل العمولات بعد إشعار مسبق لا يقل عن 15 يومًا.
                ''',
                style: Styles.contentRegular,
              ),
              44.verticalSpace,
            ],
          ),
        ),
      ),
    );
  }
}
